#+TITLE: 101pong - Vectors and Video Games - Follow-Up
#+SUBTITLE: Mathématiques - 1^{ère} année

#+LANGUAGE: fr
#+OPTIONS: H:2 toc:nil

#+INCLUDE: ../../template/Beamer.org

#+LATEX_HEADER: \input{../../package/Mathematics.tex}
#+LATEX_HEADER: \input{../../package/drawings/Drawing.tex}
#+LATEX_HEADER: \input{../../package/drawings/Geometry.tex}

#+LATEX_HEADER: \input{../Epitech.tex}


** Affichage en Python

#+BEGIN_SRC python :exports both :results output
pos_x = -39.4
pos_y = 33
pos_z = -10

print(f"({pos_x:.2f}, {pos_y:.2f}, {pos_z:.2f})")
#+END_SRC

#+RESULTS:
: (-39.40, 33.00, -10.00)


** Utilisation de la librairie Mathématiques

#+BEGIN_SRC python :exports both :results output
from math import acos, sqrt, pi

vect_x = -8.1
vect_y = 6
vect_z = -3

n = sqrt(pow(vect_x, 2) + pow(vect_y, 2) + pow(vect_z, 2))
incidence_angle_rad = acos(vect_z / n)
incidence_angle = incidence_angle_rad * (180 / pi)
angle = abs(90 - incidence_angle)
print(f"{angle:.2f}")
#+END_SRC

#+RESULTS:
: 16.57
